Repository: unattended-ch/admm
Catalog: docs/*/README.po
Languages: de

source: [Deutsch][german]
de: [English][english]

source: ADMin Menu TUI
de: ADMin Menü TUI

source: Manage your server from console
de: Den Server von den Konsole verwalten

source: ## DESCRIPTION
de: ## BESCHREIBUNG

source: admm is a administrator menu TUI for console based on shell scripts
de: admm ist ein Administrator Menü TUI für Konsole basierend auf Shell scripts

source: admm [OPTIONS] <Enter>
de: admm [OPTIONEN] <Enter>

source: admm is written with Lazarus and the freevision package
de: admm wurde entwickelt mit Lazarus und freevision paket

source: [Tutorial Videos][tutorial]
de: [Anleitungs Videos][tutorial]

source: ## SYNOPSIS
de: ## ÜBERSICHT

source: The basic idea is to use existing shell scripts and display them in a menu
de: Die Grund Idee ist der Einsatz von existierenden Shell scripts in einem Menü

source: Start admm and press F4 to edit index.mnu or press F3 to edit index.conf for your needs
de: Starte admm und drücke F4 um index.mnu oder F3 um index.conf zu bearbeiten

source: With admm you can edit the menus and scripts, append a new entry to menus and add new scripts
de: Mit admm kann man Menüs und Scripts bearbeiten, neue Einträge einfügen und neue Scripts erstellen

source: If a command is executed, the screen output will be appended to output.log To send output.log as email to $INFORM run admm -e
de: Beim ausführen eines Befehls, wird die Bildschirmausgabe der Datei output.log angehängt. Um output.log per Email an $INFORM zu versenden starte admm -e

source: If a menu or script file is edited, the menu version will be incremented and all modifications are saved as diff output in file changes.log
de: Wenn eine Menü- oder Script- Datei editiert wird, erhöht sich die Version automatisch und alle Änderungen werden als diff Ausgabe der Datei changes.log angehängt

source: On Master and Clients you always load the scripts from the Master Server= URL if specified [admm.conf -> Server=http://server.domain/share/admm-scripts.tar.gz] On a master server you can modify the menu files and save them for all nodes on this server with [admm Maintenance Menu -> Create admm-scripts.tar.gz]
de: Auf dem Master und den Klienten werden die Scripts vom Master Server= URL wenn angegeben [admm.conf -> Server=http://server.domain/share/admm-scripts.tar.gz]. Auf einem Master Server kann man die Menü Dateien bearbeiten und für alle auf diesem Server speichern mit [admm Maintenance Menu -> Create admm-scripts.tar.gz]

source: To send emails you must install sSMTP or mSMTP on the master and define [index.conf -> INFORM=name@domain] You can find it under [System Installation Menu -> System Software Menu]
de: Um Emails zu versenden muss sSMTP oder mSMTP auf dem Master installiert werden. Man findet Installationen unter [System Installation Menu -> System Software Menu]. Definiere [index.conf -> INFORM=name@domain] mit der Admin Email Adresse

source: admm can autoplay hotkey commands with --run="X " X is the hotkey character from Menu or Submenu, use " " to leave a submenu or " " to exit menu If you append -e user $INFORM will be informed with output.log After sending the email output.log will be deleted
de: admm kann automatisch Schnelltasten Befehle abspielen mit --run="X ". X ist die Schnelltaste aus dem Menü oder Untermenü, benutze ein " " um das Untermenü oder Menü zu verlassen. Wenn man -e anhängt wird Benutzer $INFORM die Datei output.log gesendet. Nach dem versenden wird output.log gelöscht

source: You can extend command line parameters with your own commands. You must insert your command in index.conf [Commands] -cmd="aa "=Comment
de: Man kann Kommandozeilen Parameter erweitern mit eigenen Befehlen. Man muss dazu den Befehl einfügen in index.conf [Commands] -cmd="aa "=Comment

source: GPG is used to create and read encrypted password files for scripts.
de: GPG wird verwendet um Verschlüsselte Dateien mit Passwörtern zu erstellen und zu lesen.

source: ## OPTIONS
de: ## OPTIONEN

source: -c --changes Display changes.log -d --debug=N Set debug level (see admm.conf) -e --email Send email with output.log to $INFORM -h --help Display options help -l --log Display admm.log -o --out Display output.log -r --run="aM " Autorun hotkey commands from Menu -s --server="" Select server with admm-*.tar.gz
de: -c --changes changes.log anzeigen -d --debug=N Debug level setzen (see admm.conf) -e --email Email versenden mit output.log an $INFORM -h --help Optionen Hilfe anzeigen -l --log admm.log anzeigen -o --out output.log anzeigen -r --run="aM " Ausführen von Schnelltasten des Menüs -s --server="" Wähle Server mit admm-*.tar.gz

source: -u Run system dist-upgrade (see index.conf [Commands]) -a Run system autoremove (see index.conf [Commands])
de: -u Starte System dist\-upgrade (siehe index.conf [Commands]) -a Starte System autoremove (siehe index.conf [Commands])

source: ## FILES
de: ## DATEIEN

source: /usr/local/bin/admm Executable /usr/local/etc/admm.conf Configuration for admm /usr/local/share/admm/plugins/template/*.tmpl Templates for .man .mnu .sh /usr/local/share/admm/sripts/debian/index.mnu Main menu for admm /usr/local/share/admm/sripts/debian/index.conf Main menu configuration /usr/local/share/admm/sripts/debian/... Location for menus and shell scripts or other files used by scripts /usr/local/share/admm/admm.log Log file of admm, to enable set Debug= > 0 (Default = 1) /usr/local/share/admm/changes.log Log file with changes of menu and script files (Debug= > 0) /usr/local/share/admm/output.log Log file with output of executed scripts (Debug= > 0) /usr/local/man/admm.man This page
de: /usr/local/bin/admm Ausführbare Datei /usr/local/etc/admm.conf Konfiguration für admm /usr/local/share/admm/plugins/template/*.tmpl Vorlagen für .man .mnu .sh /usr/local/share/admm/sripts/debian/index.mnu Hauptmenü für admm /usr/local/share/admm/sripts/debian/index.conf Hauptmenü konfiguration /usr/local/share/admm/sripts/debian/... Ordner für Menüs und Scripts oder andere benötigte Dateien /usr/local/share/admm/admm.log Logdatei von admm, Aktivieren mit Debug= > 0 (Default = 1) /usr/local/share/admm/changes.log Logdatei mit Änderungen von Menüs und Script (Debug= > 0) /usr/local/share/admm/output.log Logdatei mit Ausgabe der ausgeführten Befehle (Debug= > 0) /usr/local/man/admm.man Man Seite für admm

source: ## FUNCTION KEYS
de: ## FUNKTIONS TASTEN

source: F1 - Display Help if available (press F6 to create a new man page) F2 - Start mc F3 - Edit index.conf (global menu configuration) F4 - Edit displayed Menu with mcedit F5 - Edit selected Menu or Shell script with mcedit, if not exists create it with template F6 - Edit existing Help or create a new man page F7 - Output of last executed command F8 - Load Mainmenu F9 - Display admm.log F10- Exit SF1- Display admm.man SF2- Run mc in folder wherr menu file is located SF3- Edit admm.conf SF5- Edit functions.inc SF7- Display ouput.log SF8- Run admm-scripts.sh for export to server SF9- Display changes.log
de: F1 - Hilfeseite anzeigen wenn vorhanden (drücke F6 für eine neue Seite) F2 - Starte mc F3 - Bearbeite index.conf (Globale Menü Konfiguration)n F4 - Bearbeite angezeigtes Menü mit mcedit F5 - Bearbeite gewähltes Menü oder Script mit mcedit, wenn die Datei nicht existiert wird sie mit Vorlage erzeugt F6 - Bearbeite existierende Hilfeseite oder erstelle eine neue F7 - Ausgabe des letzten Befehls F8 - Lade Hauptmenü F9 - admm.log Anzeigen F10- Beenden SF1- admm.man anzeigen SF2- mc in Ordner der Menu Datei ausführen SF3- admm.conf bearbeiten SF5- functions.inc bearbeiten SF7- ouput.log anzeigen SF8- admm-scripts.sh ausführen für Server export SF9- changes.log anzeigen

source: ## NAVIGATION KEYS
de: ## NAVIGATIONS TASTEN

source: UP-/DOWN-Arrow - Select Menu position RIGHT-Arrow - Open Submenu (not Shell scripts) LEFT-Arrow - Exit from Menu or Submenu SPACE - Exit from Menu or Submenu ENTER - Execute selected Menu position
de: UP-/DOWN-Arrow - Wähle Menü position RIGHT-Arrow - Öffne Untermenü (nicht Shell scripts) LEFT-Arrow - Beende Menü oder Untermenü SPACE - Beende Menü or Untermenü ENTER - Ausgewählte Menü position ausführen

source: ## MOUSE KEYS
de: ## MAUS TASTEN

source: Left - Select a button by click, double-click to execute the command Right - Select a button by click, double-click to edit the file
de: Left - Taste auswählen durch klick, doppel-klick ausführen des Befehls Right - Taste auswählen durch klick, doppel-klick bearbeiten der Datei

source: ## CONFIGURATION
de: ## KONFIGURATION
